---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CantKeepConstraintsToBars
source: html/92b1d6c6-5e03-9414-ba4f-66c9090044a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CantKeepConstraintsToBars Property

The constraints between the coupler and the two connected bars are no longer satisfied. Post error to delete the coupler.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantKeepConstraintsToBars { get; }
```